goran-mahovlic/reverse_mono_6ks/Src/stm32f4_spi_master_emul.c
/* DMA Handle declaration Rx*/
static DMA_HandleTypeDef  hdma_tim4_ch1;

/* Timer Output Compare Configuration Structure declaration */
static TIM_OC_InitTypeDef       sConfig;
static TIM_OC_InitTypeDef       sConfig1;

/* SPI Emulation Handle */
static SPI_Emul_HandleTypeDef *sspi;

/* Buffer used for transmission */
static uint32_t *pBuffer_Tx[4*(TX_BUFFER_SIZE)];

/* Buffer used for reception */
static uint32_t *pBuffer_Rx[4*(RX_BUFFER_SIZE)];

/* Private Generic function prototypes ------------------------------------------*/
static void SPI_Emul_SetConfig (SPI_Emul_HandleTypeDef *spi);
static void SPI_Emul_DMAError(DMA_HandleTypeDef *hdma);
static void SPI_Emul_EnableRessources(SPI_Emul_HandleTypeDef *hspi);

/* Private Tx function prototypes -----------------------------------------------*/
static void SPI_Emul_SetConfig_DMATx(void);
static void SPI_Emul_DMAHalfReceiveCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_DMAHalfTransmitCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_TransmitFormatFrame(SPI_Emul_HandleTypeDef *spi , uint16_t pData, uint32_t *pBuffer_tmp_Tx);
static void SPI_Emul_Transmission_Process_Complete(void);

/* Private Rx function prototypes -----------------------------------------------*/
static void SPI_Emul_DMAHalfReceiveCplt(DMA_HandleTypeDef *hdma);
static void SPI_Emul_SetConfig_DMARx(void);
static void SPI_Emul_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static uint32_t SPI_Emul_ReceiveFormatFrame(SPI_Emul_HandleTypeDef *hspi, uint32_t *pBuffer);
static void SPI_Emul_Reception_Process_Complete(void);

uint16_t TmpBuffer[0x10];
volatile uint32_t IrqTx = 0x00;
volatile uint32_t IrqRx = 0x00;
extern volatile uint32_t RestTx;
volatile uint32_t RestRx = 0x00;
volatile uint32_t LastTx = 0x00;

/** @defgroup SPI_EMUL_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          de-initialize the SPI Emulator:

(+) Call the function HAL_SPI_Emul_Init() to configure these parameters:
        (++) Mode
        (++) Direction
        (++) Data Size
        (++) Clock Polarity and Phase
        (++) NSS Management
        (++) Clock Speed
        (++) FirstBit
        (++) TIMode
        (++) CRC Calculation
        (++) CRC Polynomial if CRC enabled

        (+) Call the function HAL_SPI_DeInit() to restore the default configuration
          of the SPI Emulator.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the SPI Emulation according to the specified parameters
  *         in the SPI_Emul_InitTypeDef and create the associated handle.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *         the configuration information for SPI module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Emul_Init(SPI_Emul_HandleTypeDef *hspi)
{
  /* Check the SPI handle allocation */
  if (hspi == NULL)
  {
    return HAL_ERROR;
  }
  if (hspi->State == HAL_SPI_EMUL_STATE_RESET)
  {
    /* Init the low level hardware : GPIO, CLOCK, NVIC... */
    HAL_SPI_Emul_MspInit(hspi);
  }
  /* Get Structure for spi emul Handle */
  sspi = hspi;

  /* Set the TIM state */
  hspi->State = HAL_SPI_EMUL_STATE_BUSY;

  /* Set the SPI Emulation Communication parameters */
  SPI_Emul_SetConfig(hspi);

  /* Initialize the SPI Emulation state */
  hspi->ErrorCode = HAL_SPI_EMUL_ERROR_NONE;
  hspi->State = HAL_SPI_EMUL_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  DeInitializes the SPI Emulation .
  * @param  hSPI: SPI Emulation handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_SPI_Emul_DeInit(SPI_Emul_HandleTypeDef *hspi)
{
  /* Check the SPI handle allocation */
  if (hspi == NULL)
  {
    return HAL_ERROR;
  }

  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  HAL_SPI_Emul_MspDeInit(hspi);

  hspi->ErrorCode = HAL_SPI_EMUL_ERROR_NONE;
  hspi->State = HAL_SPI_EMUL_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief SPI Emulation MSP Init.
  * @param  hspi: SPI Emulation Handle.
  * @retval None
  */
__weak void HAL_SPI_Emul_MspInit(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
           the HAL_SPI_Emul_MspInit could be implemented in the user file
  */
}

/**
  * @brief SPI Emulation MSP DeInit
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
__weak void HAL_SPI_Emul_MspDeInit(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_Emul_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */
/**
  * @brief  Configures the SPI Emulation peripheral.
             + Enable clock for ALL peripheral Timer, GPIO
             + DMA 2 Configuration channel, Stream, Mode? Priority, ...
             + Configuration SPI Emulation CR registre software
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
static void SPI_Emul_SetConfig (SPI_Emul_HandleTypeDef *hspi)
{
  uint32_t bit_time = 0;

  /* Check the parameters */
  assert_param(IS_SPI_EMUL_MODE(hspi->Init.Mode));
  assert_param(IS_SPI_EMUL_DIRECTION(hspi->Init.Direction));
  assert_param(IS_SPI_EMUL_DATASIZE(hspi->Init.DataSize));
  assert_param(IS_SPI_EMUL_POLARITY(hspi->Init.CLKPolarity));
  assert_param(IS_SPI_EMUL_PHASE(hspi->Init.CLKPhase));
  assert_param(IS_SPI_CLK(hspi->Init.SPI_Clk));
  assert_param(IS_SPI_EMUL_FIRSTBIT(hspi->Init.FirstBit));

  /* Init Bit Time */
  if ((HAL_RCC_GetSysClockFreq() / HAL_RCC_GetPCLK2Freq() == 1))
  {
    bit_time = ((uint32_t) ((HAL_RCC_GetSysClockFreq() / hspi->Init.SPI_Clk) - 1));
  }
  else
  {
    bit_time = ((uint32_t) (((HAL_RCC_GetPCLK2Freq() * 2) / hspi->Init.SPI_Clk) - 1));
  }

  /*##-1- Configure  the Timer peripheral (TIM4) in Bit Delay ##############*/
  /* Initialize TIM4 peripheral as follow:
  + Period = TimerPeriod 
  + Prescaler = 0
  + ClockDivision = 0
  + Counter direction = Up
  */
  TimHandle.Instance            = TIM4;
  TimHandle.Init.Prescaler      = 0;
  TimHandle.Init.ClockDivision  = 0;
  TimHandle.Init.CounterMode    = TIM_COUNTERMODE_UP;
  HAL_TIM_PWM_Init(&TimHandle);

  /*##-2- Configure the PWM channel 1 #########################################*/
  sConfig.OCMode       = TIM_OCMODE_PWM1;
  sConfig.OCPolarity   = TIM_OCPOLARITY_LOW;
  sConfig.OCFastMode   = TIM_OCFAST_ENABLE;
  sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;
  HAL_TIM_PWM_ConfigChannel(&TimHandle, &sConfig, TIM_CHANNEL_1);

  /*##-2- Configure the PWM channel 2 #########################################*/
  sConfig1.OCMode       = TIM_OCMODE_PWM1;
  if (hspi->Init.CLKPolarity == SPI_EMUL_POLARITY_LOW)
  {
    sConfig1.OCPolarity   = TIM_OCPOLARITY_HIGH;
  }
  else if (hspi->Init.CLKPolarity == SPI_EMUL_POLARITY_HIGH)
  {
    sConfig1.OCPolarity   = TIM_OCPOLARITY_LOW;

    //if (hspi->Init.ClkPinNumber == GPIO_PIN_13)
    //{
    //  (sspi->ClkPortName)->PUPDR |= 0x00040000;
   // }
    //else /* sspi->ClkPinName == GPIO_PIN_8 */
    //{
     // GPIOD->PUPDR |= 0x00010000;
    //}
  }
  sConfig1.OCFastMode   = TIM_OCFAST_ENABLE;
  sConfig1.OCIdleState  = TIM_OCIDLESTATE_RESET;
  HAL_TIM_PWM_ConfigChannel(&TimHandle, &sConfig1, TIM_CHANNEL_2);

  TIMx->ARR |= bit_time;
  TIMx->CCR2 |= bit_time / 2;

  if (hspi->Init.CLKPhase == SPI_EMUL_PHASE_2EDGE)
  {
    TIMx->CCR1 |= bit_time;
  }
  else if (hspi->Init.CLKPhase == SPI_EMUL_PHASE_1EDGE)
  {
    TIMx->CCR1 |= bit_time / 2;
  }

