goran-mahovlic/reverse_mono_6ks/Src/stm32f4_spi_master_emul.c
  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX) && (hspi->Init.Mode == SPI_EMUL_MODE_MASTER))
  {
    /* Configure SPI Emulation in Transmission mode */
    SPI_Emul_SetConfig_DMATx();
  }
  else if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_RX) && (hspi->Init.Mode == SPI_EMUL_MODE_MASTER))
  {
    /* Configure SPI Emulation in Reception mode */
    SPI_Emul_SetConfig_DMARx();
  }
}

/**
  * @brief  Configures the DMA for SPI Emulation transmission.
             + DMA 2 Configuration channel, Stream, Mode? Priority, ...
  * @param  None
  * @retval None
  */
static void SPI_Emul_SetConfig_DMATx(void)
{

  /*##-1- Configure  DMA For SPI Emulation TX #############################*/
  /* Set the parameters to be configured */
  hdma_tim4_ch2.Init.Channel              = DMA_CHANNEL_1;                /* DMA_CHANNEL_6                        */
  hdma_tim4_ch2.Init.Direction            = DMA_MEMORY_TO_PERIPH;         /* Transfer mode                        */
  hdma_tim4_ch2.Init.PeriphInc            = DMA_PINC_DISABLE;             /* Peripheral increment mode Disable    */
  hdma_tim4_ch2.Init.MemInc               = DMA_MINC_ENABLE;              /* Memory increment mode Enable         */
  hdma_tim4_ch2.Init.PeriphDataAlignment  = DMA_PDATAALIGN_WORD ;         /* Peripheral data alignment : Word     */
  hdma_tim4_ch2.Init.MemDataAlignment     = DMA_MDATAALIGN_WORD ;         /* memory data alignment :  Word        */
  hdma_tim4_ch2.Init.Mode                 = DMA_CIRCULAR;                 /* Circular DMA mode                    */
  hdma_tim4_ch2.Init.Priority             = DMA_PRIORITY_HIGH;            /* priority level : high                */
  hdma_tim4_ch2.Init.FIFOMode             = DMA_FIFOMODE_DISABLE;         /* FIFO mode disabled                   */
  hdma_tim4_ch2.Init.FIFOThreshold        = DMA_FIFO_THRESHOLD_FULL;      /* FIFO threshold full configuration    */
  hdma_tim4_ch2.Init.MemBurst             = DMA_MBURST_SINGLE;            /* Memory burst                         */
  hdma_tim4_ch2.Init.PeriphBurst          = DMA_PBURST_SINGLE;            /* Peripheral burst                     */

  /* Set hdma_tim instance */
  hdma_tim4_ch2.Instance = DMA1_Stream3;
  hdma_tim4_ch2.Parent = TimHandle.hdma[1];

  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[1] , hdma_tim4_ch2);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[1]);

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

  /* Configure DMA Stream source and destination address */
  hdma_tim4_ch2.Instance->PAR =  (uint32_t) & ((sspi->TxPortName)->BSRR);
  hdma_tim4_ch2.Instance->M0AR = (uint32_t)pBuffer_Tx;

  /* Configure DMA Stream data length */
  if ((sspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (sspi->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    hdma_tim4_ch2.Instance->NDTR = NUMBER_OF_DATA_ITEMS;
  }
  else
  {
    if ((sspi->TxXferSize) < 20)
    {
      hdma_tim4_ch2.Instance->NDTR = 2 * (sspi->TxXferSize) * (sspi->Init.DataSize);
    }
    else
    {
      hdma_tim4_ch2.Instance->NDTR = NUMBER_OF_DATA_ITEMS / 2;
    }
  }
}

/**
 * @brief  Sends an amount of data
 * @param  hspi: SPI Emulation handle
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
*/
HAL_StatusTypeDef HAL_SPI_Emul_Transmit_DMA(SPI_Emul_HandleTypeDef *hspi, uint8_t *pData, uint16_t Size)
{
  uint32_t counter_format = 0;
  uint32_t counter_shift = 0;
  uint16_t pData_16bit = 0;
  uint32_t test_hal_spi_state_ready = HAL_SPI_STATE_READY;

  if ((hspi->State == test_hal_spi_state_ready) || (hspi->State == HAL_SPI_EMUL_STATE_BUSY_RX))
  {
    if ((pData == NULL) || (Size == 0))
    {
      return  HAL_ERROR;
    }
    /* Configure communication */
    hspi->ErrorCode   = HAL_SPI_EMUL_ERROR_NONE;

    hspi->TxXferSize  = Size;
    hspi->pTxBuffPtr  = pData;
    hspi->TxXferCount = 0;

    /* Check if a receive process is ongoing or not */
    if (hspi->State == HAL_SPI_EMUL_STATE_BUSY_RX)
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_TX_RX;
    }
    else
    {
      hspi->State = HAL_SPI_EMUL_STATE_BUSY_TX;
    }
    /* Set the SPI TxDMA transfer complete callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferCpltCallback = SPI_Emul_DMATransmitCplt;

    /* Set the SPI TxDMA half transfer callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = SPI_Emul_DMAHalfTransmitCplt;

    /* Set the DMA error callback */
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferErrorCallback = SPI_Emul_DMAError;

    if ((sspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (sspi->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
    {
      for (counter_format = 0; counter_format < 20; counter_format++)
      {
        pData_16bit = (pData[counter_shift+1] << ONE_BYTE) | pData[counter_shift];
        SPI_Emul_TransmitFormatFrame(hspi, pData_16bit, (uint32_t*)(pBuffer_Tx + counter_format*16));
        sspi->TxXferCount++;
        counter_shift += 2;
      }
    }
    else
    {
      for (counter_format = 0; counter_format < 20; counter_format++)
      {
        SPI_Emul_TransmitFormatFrame(hspi, *(pData + counter_format), (uint32_t*)(pBuffer_Tx + counter_format*8));
        sspi->TxXferCount++;
      }
    }

    SPI_Emul_EnableRessources(hspi);
    return HAL_OK;
  }
  else
  {
    return HAL_BUSY;
  }
}

/**
  * @brief  This function is executed to enable transmission ressources
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
static void SPI_Emul_EnableRessources(SPI_Emul_HandleTypeDef *hspi)
{
  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi->Init.Direction == SPI_EMUL_DIRECTION_RX))
  {
    /* Enable the transfer complete interrupt (Reception) */
    __HAL_DMA_ENABLE_IT(&hdma_tim4_ch1, DMA_IT_TC);

    /* Enable the transfer complete interrupt (Reception) */
    __HAL_DMA_ENABLE_IT(&hdma_tim4_ch1, DMA_IT_HT);

    /* Enable the transfer Error interrupt (Reception) */
    __HAL_DMA_ENABLE_IT(&hdma_tim4_ch1, DMA_IT_TE);

    /* Enable the TIM Update DMA request (Reception) */
    __HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC2);
  }
  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi->Init.Direction == SPI_EMUL_DIRECTION_TX))
  {
    /* Enable the transfer complete interrupt (Transmission) */
    __HAL_DMA_ENABLE_IT(&hdma_tim4_ch2, DMA_IT_TC);

