goran-mahovlic/reverse_mono_6ks/Src/stm32f4_spi_master_emul.c
    /* Enable the half transfer complete interrupt (Transmission) */
    __HAL_DMA_ENABLE_IT(&hdma_tim4_ch2, DMA_IT_HT);

    /* Enable the transfer Error interrupt (Transmission) */
    __HAL_DMA_ENABLE_IT(&hdma_tim4_ch2, DMA_IT_TE);

    /* Enable the TIM Update DMA request */
    __HAL_TIM_ENABLE_DMA(&TimHandle, TIM_DMA_CC1);
  }
  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi->Init.Direction == SPI_EMUL_DIRECTION_TX))
  {
    /* Enable the Peripheral */
    __HAL_DMA_ENABLE(&hdma_tim4_ch2);
  }
  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi->Init.Direction == SPI_EMUL_DIRECTION_RX))
  {
    __HAL_DMA_ENABLE(&hdma_tim4_ch1);
  }
  if ((hspi->Init.CLKPhase == SPI_EMUL_PHASE_1EDGE) && ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi->Init.Direction == SPI_EMUL_DIRECTION_RX)))
  {
    TIMx->EGR |= 0x004;
  }
  if ((hspi->Init.Direction == SPI_EMUL_DIRECTION_TX_RX) || (hspi->Init.Direction == SPI_EMUL_DIRECTION_TX))
  {
    /* Enable the Capture compare channel */
    TIM_CCxChannelCmd(TIM4, TIM_CHANNEL_1, TIM_CCx_ENABLE);
    TIMx->EGR |= 0x002;
  }
  TIM_CCxChannelCmd(TIM4, TIM_CHANNEL_2, TIM_CCx_ENABLE);

  __HAL_TIM_MOE_ENABLE(&TimHandle);

  /* Enable the Peripheral */
  __HAL_TIM_ENABLE(&TimHandle);

}

/**
  * @brief  This function is executed in case of Transfer Complete.
  * @param  hdma: DMA handle
  * @retval None
  */
static void SPI_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  uint8_t pData_8bit = 0;
  uint16_t pData_16bit = 0;
  __IO uint32_t counter_format = 0;
  uint32_t transfer_tx_size = sspi->TxXferSize;
  uint32_t rest_transfer_tx = RestTx;

  if ((sspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (sspi->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    if (sspi->TxXferCount <= ((transfer_tx_size) - 10))
    {
      for (counter_format = 10; counter_format < 20; counter_format++)
      {
        pData_8bit = *(sspi->pTxBuffPtr + (sspi->TxXferCount++));
        pData_16bit = ((pData_8bit + 1) << ONE_BYTE) | pData_8bit;
        SPI_Emul_TransmitFormatFrame(sspi, pData_16bit, (uint32_t*)&pBuffer_Tx[counter_format*(sspi->Init.DataSize)]);
        sspi->TxXferCount++;
      }
    }
    else
    {
      SPI_Emul_Transmission_Process_Complete();
      /* Handle for SPI Emulation Transfer Complete */
      HAL_SPI_Emul_TxCpltCallback(sspi);
    }
  }
  else
  {
    if ((sspi->TxXferSize) < 20)
    {
      SPI_Emul_Transmission_Process_Complete();
      HAL_SPI_Emul_TxCpltCallback(sspi);
    }
    else
    {
      if (((sspi->TxXferCount) + 10) <= (transfer_tx_size))
      {

        for (counter_format = 10; counter_format < 20; counter_format++)
        {
          pData_8bit = *(sspi->pTxBuffPtr + (sspi->TxXferCount++));
          SPI_Emul_TransmitFormatFrame(sspi, pData_8bit , (uint32_t*)&pBuffer_Tx[counter_format*8]);
        }
      }
      else
      {
        if ((sspi->TxXferCount) <= (transfer_tx_size))
        {
          RestTx = (transfer_tx_size) - (sspi->TxXferCount);
          for (counter_format = 10; counter_format < rest_transfer_tx + 10; counter_format++)
          {
            pData_8bit = *(sspi->pTxBuffPtr + (sspi->TxXferCount++));
            SPI_Emul_TransmitFormatFrame(sspi, pData_8bit, (uint32_t*)&pBuffer_Tx[counter_format*8]);
          }
          LastTx = 1;
        }
        else
        {

          if (LastTx == 1)
          {
            SPI_Emul_Transmission_Process_Complete();
            HAL_SPI_Emul_TxCpltCallback(sspi);
            LastTx = 0;
          }
          else
          {
            LastTx = 1;
          }
        }
      }
    }
  }
}



/**
  * @brief  This function is executed in case of Half Transfer Complete.
  * @param  hdma: DMA handle
  * @retval None
  */
static void SPI_Emul_DMAHalfTransmitCplt(DMA_HandleTypeDef *hdma)
{

  uint8_t pData_8bit = 0;
  uint16_t pData_16bit = 0;
  __IO uint32_t counter_format = 0;
  uint32_t transfer_tx_size = sspi->TxXferSize;
  uint32_t rest_transfer_tx = RestTx;

  if ((sspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (sspi->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    if (sspi->TxXferCount <= transfer_tx_size)
    {
      for (counter_format = 0; counter_format < 10; counter_format++)
      {
        pData_8bit = *(sspi->pTxBuffPtr + (sspi->TxXferCount++));
        pData_16bit = ((pData_8bit + 1) << ONE_BYTE) | pData_8bit;
        SPI_Emul_TransmitFormatFrame(sspi, pData_16bit , (uint32_t*)&pBuffer_Tx[counter_format*16]);
        sspi->TxXferCount++;
      }
    }
    else
    {
      SPI_Emul_Transmission_Process_Complete();
      HAL_SPI_Emul_TxHalfCpltCallback(sspi);
    }
  }
  else
  {
    if (((sspi->TxXferCount) + 10) <= (transfer_tx_size))
    {

      for (counter_format = 0; counter_format < 10; counter_format++)
      {
        pData_8bit = *(sspi->pTxBuffPtr + (sspi->TxXferCount++));
        SPI_Emul_TransmitFormatFrame(sspi, pData_8bit, (uint32_t*)&pBuffer_Tx[counter_format*8]);
      }
    }
    else
    {
      if (((sspi->TxXferCount)) <= (transfer_tx_size))
      {
        RestTx = ((transfer_tx_size) - (sspi->TxXferCount));
        for (counter_format = 0; counter_format < rest_transfer_tx; counter_format++)
        {
          pData_8bit = *(sspi->pTxBuffPtr + (sspi->TxXferCount++));
          SPI_Emul_TransmitFormatFrame(sspi, pData_8bit, (uint32_t*)&pBuffer_Tx[counter_format*8]);
        }
        LastTx = 1;
      }
      else
      {
        if (LastTx == 1)
        {
          SPI_Emul_Transmission_Process_Complete();
          HAL_SPI_Emul_TxCpltCallback(sspi);
          LastTx = 0;
        }
        else
        {
          LastTx = 1;
        }
      }
    }
  }
}


/**
  * @brief  This function disables ressources
  * @param  None
  * @retval None
  */
static void SPI_Emul_Transmission_Process_Complete(void)
{
  HAL_TIM_PWM_Stop(&TimHandle, TIM_CHANNEL_2);

  __HAL_DMA_DISABLE_IT(TimHandle.hdma[TIM_DMA_ID_CC1], DMA_IT_HT);
  __HAL_DMA_DISABLE_IT(TimHandle.hdma[TIM_DMA_ID_CC1], DMA_IT_TC);

  if (sspi->Init.Direction == SPI_EMUL_DIRECTION_TX)
  {
    /* Set TC flag in the SR registre software */
    __HAL_SPI_EMUL_SET_FLAG(sspi, SPI_EMUL_FLAG_TC);
  }
  /* De_Initialize counter frame for Tx */
  sspi->TxXferCount = 0;


  /* Disable the Capture compare channel */
  TIM_CCxChannelCmd(TIM4, TIM_CHANNEL_1, TIM_CCx_DISABLE);

