goran-mahovlic/reverse_mono_6ks/Src/stm32f4_spi_master_emul.c
  if ((sspi->Init.Direction == SPI_EMUL_DIRECTION_TX) && (sspi->Init.Mode == SPI_EMUL_MODE_MASTER))
  {
    TIM_CCxChannelCmd(TIM4, TIM_CHANNEL_2, TIM_CCx_DISABLE);
    __HAL_TIM_MOE_DISABLE(&TimHandle);
    __HAL_TIM_DISABLE(&TimHandle);
  }
  __HAL_DMA_DISABLE(TimHandle.hdma[TIM_DMA_ID_CC1]);

  /* Initialize the SPI Emulation state */
  sspi->ErrorCode = HAL_SPI_EMUL_ERROR_NONE;

  /* Check if a receive process is ongoing or not */
  if (sspi->State == HAL_SPI_EMUL_STATE_BUSY_TX_RX)
  {
    sspi->State = HAL_SPI_EMUL_STATE_BUSY_RX;
  }
  else
  {
    sspi->State = HAL_SPI_EMUL_STATE_READY;
  }
}

/**
  * @brief  This function formatted one Frame
  * @param  SPI Emulation Handle
  * @param  pdata pointer in data
  * @retval None
  */
static void SPI_Emul_TransmitFormatFrame(SPI_Emul_HandleTypeDef *hspi, uint16_t Data, uint32_t *pBuffer_tmp_Tx)
{
  uint32_t counter = 0;
  uint32_t bitmask = 0;

  /* Get the Pin Number */
  bitmask = (uint32_t) hspi->Init.TxPinNumber;

  if (hspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_LSB)
  {
    for (counter = 0; counter < 0x08 ; counter++)
    {
      if (((Data >> counter)&BitMask_LSB) != 0)
      {
        pBuffer_tmp_Tx[counter] = bitmask;
      }
      else
      {
        pBuffer_tmp_Tx[counter] = (bitmask << 16);
      }
    }
  }
  else if ((hspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi->Init.DataSize == SPI_EMUL_DATASIZE_8BIT))
  {
    for (counter = 0; counter < 0x08; counter++)
    {
      if (((Data << counter)&BitMask_MSB_8bit) != 0)
      {
        pBuffer_tmp_Tx[counter] = bitmask;
      }
      else
      {
        pBuffer_tmp_Tx[counter] = (bitmask << 16);
      }
    }
  }
  else if ((hspi->Init.FirstBit == SPI_EMUL_FIRSTBIT_MSB) && (hspi->Init.DataSize == SPI_EMUL_DATASIZE_16BIT))
  {
    for (counter = 0; counter < 0x10; counter++)
    {
      if (((Data << counter)&BitMask_MSB_16bit) != 0)
      {
        pBuffer_tmp_Tx[counter] = bitmask;
      }
      else
      {
        pBuffer_tmp_Tx[counter] = (bitmask << 16);
      }
    }
  }
}

/**
* @brief  This function handles DMA interrupt request for TC.
* @param  None
* @retval None
*/
void SPI_EMUL_TX_DMA_IRQHandler(void)
{
  if ((IrqTx == 0) && (sspi->TxXferSize > 20))
  {
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback(TimHandle.hdma[TIM_DMA_ID_CC1]);
    __HAL_DMA_CLEAR_FLAG(TimHandle.hdma[TIM_DMA_ID_CC1], __HAL_DMA_GET_HT_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC1]));
    IrqTx = 1;
    if (RestTx != 0x00)
    {
      __HAL_DMA_DISABLE(&hdma_tim4_ch2);
      hdma_tim4_ch2.Instance->NDTR = RestTx * (sspi->Init.DataSize);
      __HAL_DMA_ENABLE(&hdma_tim4_ch2);
    }
  }
  /* Transfer complete callback */
  else
  {
    TimHandle.hdma[TIM_DMA_ID_CC1]->XferCpltCallback(TimHandle.hdma[TIM_DMA_ID_CC1]);
    __HAL_DMA_CLEAR_FLAG(TimHandle.hdma[TIM_DMA_ID_CC1], __HAL_DMA_GET_TC_FLAG_INDEX(TimHandle.hdma[TIM_DMA_ID_CC1]));
    IrqTx = 0;
  }
}
/**
  * @brief  Returns the SPI Emulation state.
  * @param  hspi: SPI Emulation handle
  * @retval HAL state
  */
HAL_SPI_Emul_StateTypeDef HAL_SPI_Emul_GetState(SPI_Emul_HandleTypeDef *hspi)
{
  return hspi->State;
}

/**
  * @brief  This function is executed in case of error of Transfer occurrence.
  * @param  hdma : DMA Handle
  * @retval None
  */
static void SPI_Emul_DMAError(DMA_HandleTypeDef *hdma)
{
  /* SPI Emulation frame error occurred */
  __HAL_SPI_EMUL_SET_FLAG(sspi, SPI_EMUL_FLAG_FE);

  sspi->ErrorCode |= HAL_SPI_EMUL_ERROR_FE;

  HAL_SPI_Emul_ErrorCallback(sspi);
}

/**
  * @brief  This function handles SPI Emulation request.
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
void HAL_SPI_Emul_IRQHandler(SPI_Emul_HandleTypeDef *hspi)
{
  uint32_t flag = 0;
  flag = __HAL_SPI_EMUL_GET_FLAG(hspi, SPI_EMUL_FLAG_FE);

  /* SPI Emulation frame error occurred */
  if (flag != RESET)
  {
    __HAL_SPI_EMUL_CLEAR_FLAG(hspi, SPI_EMUL_FLAG_FE);

    hspi->ErrorCode |= HAL_SPI_EMUL_ERROR_FE;
  }

  flag = __HAL_SPI_EMUL_GET_FLAG(hspi, SPI_EMUL_FLAG_TC);

  /* SPI Emulation in mode Transmitter */
  if ((flag != RESET))
  {
    __HAL_SPI_EMUL_CLEAR_FLAG(hspi, SPI_EMUL_FLAG_TC);
  }

  flag = __HAL_SPI_EMUL_GET_FLAG(hspi, SPI_EMUL_FLAG_RC);

  /* SPI Emulation in mode Transmitter */
  if ((flag != RESET))
  {
    __HAL_SPI_EMUL_CLEAR_FLAG(hspi, SPI_EMUL_FLAG_RC);
  }

  if (hspi->ErrorCode != HAL_SPI_EMUL_ERROR_NONE)
  {
    /* Set the SPI Emulation state ready to be able to start again the process */
    hspi->State = HAL_SPI_EMUL_STATE_READY;

    HAL_SPI_Emul_ErrorCallback(hspi);
  }
}

/**
  * @}
  */

/**
  * @brief  Initializes the SPI Emulation Transfer Complete.
  * @param  hspi: SPI Emulation Handle
  * @retval None
  */
__weak void HAL_SPI_Emul_TxCpltCallback(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_Emul_TransferComplete could be implemented in the user file
   */
}

/**
  * @brief  Initializes the SPI Emulation Half Transfer Complete.
  * @param  hspi: SPI Emulation Handle
  * @retval None
  */
__weak void HAL_SPI_Emul_TxHalfCpltCallback(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_SPI_Emul_TransferComplete could be implemented in the user file
   */
}

/**
  * @brief  SPI Emulation error callbacks.
  * @param  hspi: SPI Emulation handle
  * @retval None
  */
__weak void HAL_SPI_Emul_ErrorCallback(SPI_Emul_HandleTypeDef *hspi)
{
  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_SPI_ErrorCallback could be implemented in the user file
   */
}

/*********************************************************************/
/*********************************************************************/
/***************************Reception Process*************************/
/*********************************************************************/
/*********************************************************************/

/**
  * @brief  Configures the DMA for SPI Emulation transmission.
             + DMA 2 Configuration channel, Stream, Mode? Priority, ...
  * @param  None
  * @retval None
  */
static void SPI_Emul_SetConfig_DMARx(void)
{
  /*##-1- Configure  DMA For SPI Emulation RX #############################*/
  /* Set the parameters to be configured */
  hdma_tim4_ch1.Init.Channel              = DMA_CHANNEL_1;                /* DMA_CHANNEL_6                        */
  hdma_tim4_ch1.Init.Direction            = DMA_PERIPH_TO_MEMORY;         /* Transfer mode                        */
  hdma_tim4_ch1.Init.PeriphInc            = DMA_PINC_DISABLE;             /* Peripheral increment mode Disable    */
  hdma_tim4_ch1.Init.MemInc               = DMA_MINC_ENABLE;              /* Memory increment mode Enable         */
  hdma_tim4_ch1.Init.PeriphDataAlignment  = DMA_PDATAALIGN_WORD ;         /* Peripheral data alignment : Word     */
  hdma_tim4_ch1.Init.MemDataAlignment     = DMA_MDATAALIGN_WORD ;         /* memory data alignment :  Word        */
  hdma_tim4_ch1.Init.Mode                 = DMA_CIRCULAR;                 /* Circular DMA mode                    */
  hdma_tim4_ch1.Init.Priority             = DMA_PRIORITY_VERY_HIGH;       /* priority level : very high           */
  hdma_tim4_ch1.Init.FIFOMode             = DMA_FIFOMODE_DISABLE;         /* FIFO mode disabled                   */
  hdma_tim4_ch1.Init.FIFOThreshold        = DMA_FIFO_THRESHOLD_FULL;      /* FIFO threshold full configuration    */
  hdma_tim4_ch1.Init.MemBurst             = DMA_MBURST_SINGLE;            /* Memory burst                         */
  hdma_tim4_ch1.Init.PeriphBurst          = DMA_PBURST_SINGLE;            /* Peripheral burst                     */

